//-------------------------------------------------------------
//! @file  TexturePS.hlsl
//! @brief ピクセルシェーダー（テクスチャマッピング用）
//! @author つきの
//-------------------------------------------------------------

// GPUに渡したテクスチャとサンプラ
Texture2D tex : register(t0);
SamplerState samp : register(s0);
//-------------------------------------------------------------
// 頂点シェーダーから渡されるデータ
//-------------------------------------------------------------
struct PSInput
{
    float4 position : SV_POSITION; // 画面上の位置
    float2 uv : TEXCOORD0; // テクスチャ座標
};

//-------------------------------------------------------------
// ピクセルシェーダー本体
//-------------------------------------------------------------
float4 main(PSInput input) : SV_TARGET
{
    // テクスチャの色を取り出して返す
    return tex.Sample(samp, input.uv);
}