//--------------------------------------------------------------
//! @file Vertex.h
//! @brief 頂点データ構造体の定義
//! @author つきの
//--------------------------------------------------------------
#pragma once
#include <DirectXMath.h>
//--------------------------------------------------------------
//! @struct Vertex
//! @brief 頂点データ構造体
//! @details 位置と色の情報を持つ頂点データ構造体
//! @note DirectXMathライブラリのXMFLOAT3とXMFLOAT4を使用
//--------------------------------------------------------------
struct Vertex {
	DirectX::XMFLOAT3 position;
    DirectX::XMFLOAT2 uv;       // テクスチャ座標
};