//--------------------------------------------------------------
//! @file Window.h
//! @brief ウィンドウ管理用クラスのヘッダ
//! @author つきの
//--------------------------------------------------------------
#pragma once
#include <Windows.h>    // WindowsAPIヘッダをインクルード
//--------------------------------------------------------------
//! @class Window
//! @brief ウィンドウ管理用クラス
//--------------------------------------------------------------
class Window {
public:
    //--------------------------------------------------------------
	// コンストラクタ
	//! @param hInstance [in] アプリケーションインスタンスハンドル
	//! @param width	 [in] ウィンドウの幅
	//! @param height	 [in] ウィンドウの高さ
    //--------------------------------------------------------------
    Window(HINSTANCE hInstance, int width, int height);

    //--------------------------------------------------------------
	// ウィンドウハンドルを取得
	//! @return ウィンドウハンドル
    //--------------------------------------------------------------
	HWND GetHandle() const;

    //--------------------------------------------------------------
	// メッセージを処理
	//! @return 継続する場合はtrue、終了する場合はfalse
    //--------------------------------------------------------------
    bool ProcessMessages();

private:
	HWND hwnd;		//ウィンドウハンドル
};